the-this-pointer/timer-board-stm32f103/Core/Src/UserInterface.c
	char secBuff[8] = {0};
	sprintf(secBuff, "%02d", DecodeBCD(sTime.Seconds));

	char dateBuff[8] = {0};
	sprintf(dateBuff, "%02d/%02d", DecodeBCD(sDate.Month), DecodeBCD(sDate.Date));

	ssd1306_Fill(Black);
	ssd1306_SetCursor(16, 5);
	ssd1306_WriteString(timeBuff, Font_16x26, White);
	
	ssd1306_SetCursor(101, 13);
	ssd1306_WriteString(secBuff, Font_11x18, White);

	ssd1306_SetCursor(36, 35);
	ssd1306_WriteString(dateBuff, Font_11x18, White);

	UserInterface_p_DrawActions(hnd->currentPage->actionIcons);
	
	SCR_DIRTY_ARG(hnd);
	return 1;
}

void mainPageInputCallback(void* uih, enum ActionType action)
{
	switch(action)
	{
		case Key1:
			UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[SettingPageIdx]);
			break;
		case Key4:
			UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[TimeListPageIdx]);
			break;
		default:
			break;
	}
}

void timeListPageOnInitCallback(void* uih)
{
	UiHandle* hnd = uih;
	TimeListPageData* data = hnd->currentPage->data;

	data->plan = Timer_GetNextFullSlot(&timeList, 0);
	data->screenIndex = 0;
	data->itemIndex = 0;
}

uint8_t timeListPageUpdateCallback(void* uih, uint32_t since)
{
	if (since < 800)
		return 0;
	UiHandle* hnd = uih;
	TimeListPageData* data = hnd->currentPage->data;
		
	if (data->plan == NULL)
	{
		ssd1306_Fill(Black);

		ssd1306_SetCursor(5, 5);
		ssd1306_WriteString("Empty List!", Font_11x18, White);
		
		UserInterface_p_DrawActions(hnd->currentPage->actionIcons);
		SCR_DIRTY_ARG(hnd);
	} else {
		char buff[16] = {0};
		
		if (data->screenIndex == 0)	// displays for about 1 second
		{
			ssd1306_Fill(Black);

			if (data->plan->mode != Daily)
				snprintf(buff, 16, "%c: %d", g_timeModes[data->plan->mode], data->plan->day);
			else
				snprintf(buff, 16, "%c", g_timeModes[data->plan->mode]);
			ssd1306_SetCursor(5, 5);
			ssd1306_WriteString(buff, Font_11x18, White);

			UserInterface_p_DrawActions(hnd->currentPage->actionIcons);
			SCR_DIRTY_ARG(hnd);
		}
		else if (data->screenIndex > 1)
		{
			TimerItem* item = TimePlan_GetNextFullSlot(data->plan, data->itemIndex);
			if (item != NULL)
			{
				ssd1306_Fill(Black);

				uint8_t offset = TimePlan_ToOffset(data->plan, item);
				data->itemIndex = offset;
				
				snprintf(buff, 16, "%02d:%02d [%s]", item->hours, item->minutes, item->status? "On": "Off");
				ssd1306_SetCursor(5, 5);
				ssd1306_WriteString(buff, Font_11x18, White);

				data->screenIndex++;

				UserInterface_p_DrawActions(hnd->currentPage->actionIcons);
				SCR_DIRTY_ARG(hnd);
			} else if (data->itemIndex == INVALID_SLOT) {
				data->itemIndex = 0;
				data->screenIndex = 0;
			}
		}
	}
	
	data->screenIndex += 1;
	data->screenIndex %= 254;
	
	return 1;
}

void timeListPageInputCallback(void* uih, enum ActionType action)
{
	UiHandle* hnd = uih;
	TimeListPageData* data = hnd->currentPage->data;

	switch(action)
	{
		case Key1:
			ACT_OFST(
							UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[MainPageIdx]), 
		
							g_menuActionsOffset -= 4
			)
			break;
		case Key2:
		{
			ACT_OFST(
							data->screenIndex = 0;
							data->itemIndex = 0;
							TimePlan* p = Timer_GetPrevFullSlot(&timeList, Timer_ToOffset(&timeList, data->plan)); 
							if(p) data->plan = p, 

							UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[AddTimePlanPageIdx])
			)
			break;
		}
		case Key3:
			ACT_OFST(
							data->screenIndex = 0;
							data->itemIndex = 0;
							TimePlan* p = Timer_GetNextFullSlot(&timeList, Timer_ToOffset(&timeList, data->plan)); 
							if(p) data->plan = p, 

							Timer_RemovePlan(&timeList, Timer_ToOffset(&timeList, data->plan)); 
							data->plan = Timer_GetNextFullSlot(&timeList, Timer_ToOffset(&timeList, data->plan))
			)
			break;
		case Key4:
			ACT_OFST(
							g_menuActionsOffset += 4, 
		
							//UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[MainPageIdx])
			)
			break;
		default:
			break;
	}
}

void addTimePlanPageOnInitCallback(void* uih)
{
	UiHandle* hnd = uih;
	AddTimePlanPageData* data = hnd->currentPage->data;

	data->settingStep = 0;
	data->plan.day = 0;
	data->plan.mode = Daily;
	
	int i;
	for (i = 0; i < MAX_TIMES_PER_DAY; i++)
		TimePlan_RemoveItem(&data->plan, i);
}

uint8_t addTimePlanPageUpdateCallback(void* uih, uint32_t since)
{
	if (since < 400)
		return 0;
	
	UiHandle* hnd = uih;
	AddTimePlanPageData* data = hnd->currentPage->data;

	ssd1306_Fill(Black);
	ssd1306_SetCursor(5, 5);

	char buff[24] = {0};
	switch(data->settingStep)
	{
		case 0:	//setting plan mode
		{
			snprintf(buff, 24, "Mode: %c", g_timeModes[data->plan.mode]);
			break;
		}
		case 1: //setting day if mode is w/m
		{
			if (data->plan.mode == Weekly)
			{
				snprintf(buff, 24, "Day: %s", g_weekDays[data->plan.day]);
			}
			else if (data->plan.mode == Monthly)
			{
				snprintf(buff, 24, "Day: %d", data->plan.day+1);
			}
			break;
		}
	}
	ssd1306_WriteString(buff, Font_11x18, White);
	UserInterface_p_DrawActions(hnd->currentPage->actionIcons);
	
	SCR_DIRTY_ARG(hnd);
	return 1;
}

void addTimePlanPageInputCallback(void* uih, enum ActionType action)
{
	UiHandle* hnd = uih;
	AddTimePlanPageData* data = hnd->currentPage->data;

	switch(action)
	{
		case Key1:
			UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[TimeListPageIdx]);
			break;
		case Key2:
			if (data->settingStep == 0)
			{
				data->plan.mode = (data->plan.mode + 4 - 1) % 4;
				if (data->plan.mode == 0)
					data->plan.mode = Daily;
			}
			else if (data->settingStep == 1)
			{
				if (data->plan.mode == Weekly)
					data->plan.day = (data->plan.day + 7 - 1) % 7;
				else if (data->plan.mode == Monthly)
					data->plan.day = (data->plan.day + 31 - 1) % 31;
			}
			break;
		case Key3:
			if (data->settingStep == 0)
			{
				data->plan.mode = (data->plan.mode + 1) % 4;
				if (data->plan.mode == 0)
					data->plan.mode = Monthly;
			}
			else if (data->settingStep == 1)
			{
				if (data->plan.mode == Weekly)
					data->plan.day = (data->plan.day + 1) % 7;
				else if (data->plan.mode == Monthly)
					data->plan.day = (data->plan.day + 1) % 31;
			}
			break;
		case Key4:
		{
			if (data->plan.mode != Daily && data->settingStep < 1)
			{
				data->settingStep++;
			}
			else
			{
				TimePlan* newPlan = Timer_AddPlan(&timeList, data->plan.mode);
				if (newPlan == NULL)
					Error_Handler();
				newPlan->day = data->plan.day+1;
				
